/**
 * @file directional-conf.js
 * @author xiaokl
 */
/* eslint-disable */
var carriers = {
    0: 'wifi',
    1: '中国移动',
    2: '中国联通',
    3: '中国电信',
    4: '其他',
    5: '未识别'
};
var connectiontypes = {
    0: '未知',
    1: '以太网',
    2: 'Wifi',
    3: '移动数据-未知',
    4: '2G',
    5: '3G'
};
var models = {
    apple: '苹果',
    xiaomi: '小米',
    vivo: 'Vivo',
    oppo: 'Oppo',
    samsung: '三星',
    huawei: '华为',
    meizu: '魅族',
    honor: '荣耀',
    gionee: '金立',
    lenovo: '联想'
};
var imei_prices = {
    1: '0-500',
    2: '500-1000',
    3: '1000-2000',
    4: '2000-3000',
    5: '3000-4000',
    6: '4000以上'
}
var times = {
    1: {
        0: '00:00',
        1: '01:00',
        2: '02:00',
        3: '03:00',
        4: '04:00',
        5: '05:00'
    },
    2: {
        6: '06:00',
        7: '07:00',
        8: '08:00',
        9: '09:00',
        10: '10:00',
        11: '11:00'
    },
    3: {
        12: '12:00',
        13: '13:00',
        14: '14:00',
        15: '15:00',
        16: '16:00',
        17: '17:00'
    },
    4: {
        18: '18:00',
        19: '19:00',
        20: '20:00',
        21: '21:00',
        22: '22:00',
        23: '23:00'
    }
};
var interests = {
    '1': '网购达人',
    '2': '游戏玩家',
    '3': '理财高手',
    '4': '爱车一族',
    '5': '商务人士',
    '6': '美食达人',
    '7': '旅游达人',
    '8': '健康医疗',
    '9': '视频爱好',
    '10': '音乐达人',
    '11': '婚恋交友',
    '12': '打车人士',
    '13': '银行支付',
    '14': '社交达人'
};
var channels = {
    1: '电视剧',
    2: '电影',
    3: '综艺',
    4: '动漫'
};
var android_versions = ['4.0', '4.1', '4.2', '4.4', '5.0', '6.0'];
var ios_versions = ['4', '5', '6', '7', '8', '9'];